// HW
// 11.

// Створити глобальну змінну name = "Global".
// У функції оголосити змінну з таким же ім’ям "Local" і вивести обидві.

// const name = "Global"
// if(true){
// const name = "Local"
// }
// console.log(name);
// console.log(name);



// 12.

// Створити змінну в глобальній області.
// У блоці if створити змінну з тим же ім’ям через let і вивести обидві.

// const globalText = "nana"
// if(true){
//     let globalText ="dkdk"
//     console.log(globalText);
//     console.log(globalText);
// }




// 13.

// Написати код, в якому змінна, оголошена у блоці if, недоступна зовні.
// Пояснити чому.
// if(true){
//     const localText = "local"

// }
// console.log(localText);
//Вона не працює, тому що зміна знаходиться в IF. А якщо зміна знаходиться в IF, вона тільки там і буде працювати. Тобто ми не можемо винести цю зміну поза межі IF.


// 14.

// Створити два вкладених блоки if.
// У кожному оголосити свої змінні. Перевірити, які змінні видно у внутрішньому та зовнішньому блоці.

// if(true){
//     const text1 = "text"
//     console.log(text1);
    
// }
// if(true){
//     const text2 = "text2"
//     console.log(text2);
    
// }
// console.log(text1);
// console.log(text2);


// 15.

// Оголосити змінну let x = 10;.
// Усередині if(true) змінити її значення.
// Пояснити, чому це працює (змінна глобальна).

// let x = 10
// if(true){
//     x = 20
// }
// console.log(x);
//Це працює, тому що зміна X створена через let, а зміні let можна змінювати значення в коді. 
// В if було правдива перевірка, тому те, що було всередині, виконалось, і зміна X змінилася на 20.

// 16.

// Оголосити змінну через var всередині if.
// Перевірити, чи буде вона доступна зовні (буде — через function scope).
// if(true){
//     var text = "lala"
// }
// console.log(text);

// 17.

// У функції створити змінну.
// Перевірити, чи доступна вона поза функцією (не буде доступна — function scope).
// if(true){
//     const message = "apple"
// }
// console.log(message);

// 18.

// Створити цикл for.
// Всередині оголосити змінну let i.
// Перевірити, чи доступний i зовні циклу.

for(let i = 0; i<max ; i++){
    console.log("block", i);
    
}
console.log("global", i);

// 19.

// Створити дві змінні з однаковим ім’ям у різних областях (global, block).
// Зробити так, щоб внутрішня “перекривала” зовнішню.

// let oblast = "global"
// if(true){
// oblast = "block"
// }
// console.log(oblast);


// 20.

// Написати програму, яка показує проблему відсутності break у switch:
// Зробити кейси без break і показати, як виконується кілька кейсів поспіль.